import React from 'react'
import './Policies.scss'
import CommonHead from '../../Components/CommonHead/CommonHead'
import { useMyContext } from '../../context/MyContext'
const Policies = () => {
    const part1 = [" إدارة خدمات قوى", "إدارة خدمات التأمينات الإجتماعية ", "إدارة خدمات وزارة التجارة ", "إدارة خدمات أبشر، مقيم ", "إدارة خدمات بلدي ", "إدارة خدمات الغرفة التجارية ", "إدارة خدمات الغرفة التجارية ", "إدارة خدمات الزكاه والدخل ", "إدارة خدمات مكتب العمل", "إدارة خدمات برامج الدعم ", "إدارة خدمات التأمين الطبي "]
    const part2 = ["إدارة خدمات ناجز", "إدارة خدمات نافذ"]
    const part3 = ["إدارة الرواتب وحماية الأجور ", "توثيق عقود العمل للموظفين ", "تخفيف الأعباء الماليه"]
    const part4 = ["تصميم موقع إلكتروني ", "تصميم متجر إلكتروني ", "تصميم لوقـو احترافي ", "خدمات التسويق الإلكترونى",]
    const fifth = ["أ - يتعهد المستفيد بعدم تعطيل الخدمة والتعاون مع إنجاز في تقديم الخدمة لمنشأته بأسرع وقت وفي حال عدم التعاون يحق ل إنجاز إنهاء الاشتراك .", "ب - يتعهد المستفيد بعدم الاساءة لموظفي إنجاز أو لكيان الشركة وسلوك الطرق الصحيحة في حال وجود أي شكاوي اتجاه الخدمة ويتعهد عند قيامه بذلك بدفع التعويض اللازم عن أي ضرر أو خسائر بسبب تلك المخالفة بحسب ما تقرره الأنظمة النافذة في المملكة العربية السعودية، كما يتحمل المشترك كافة الغرامات الصادرة بحقه من الجهات المختصة", "ج - يتحمل المشترك كافة المسؤوليات الناتجة عن الطلبات الصادرة من الموظف أو المفوض في التعامل مع إنجاز .", "د - لا يحق للمستفيد مطالبة إنجاز بأي تعويض نظير تأخر الخدمة بسبب أعطال تقنية أو بأسباب أخرى .", "هـ - يتعهد المستفيد بتزويد إنجاز بكافة أسماء المستخدمين وكلمات المرور لجميع حسابات المنشأة في الجهات الحكومية وفي حال تغييرها إعلام الشركة بذلك ."]
    const ninth = ["1) لا تتحمل إنجاز مسؤولية المشاكل الناتجة عن عدم صحة أو تحديث المعلومات المقدمة للمشترك من الجهات المختصة عن طريق نظام المنشأة .", "2)  لا تتحمل إنجاز المخالفات التي تقع على المنشأة بأي سبب من الأسباب ولا يحق للمشترك مطالبتها بذلك .", "3)  لا تتحمل إنجاز أي مسؤولية تجاه أية خسائر تقع على المشترك (مباشرة أو غير مباشرة) ناتجة عن القيام بتنفيذ هذا الاشتراك .", "4)  تحتفظ إنجاز بحقها في تقييد استخدام الخدمة بوضع حد أقصى للخدمات المقدمة .", "5) يوافق المستفيد على إخلاء مسؤولية إنجاز عن أخطاء مقدمي خدمات الاتصالات أو مواقع الجهات الحكومية ، مثل تعطل الاتصال بالموقع الإلكتروني.", "6) وافق المشترك على أن لـ إنجاز الحق في إتلاف أو عدم إبراز اصول المستندات، ويعتبر ما تقدمه إنجاز من صور لها في هذا الشان يعد مستندا له حجة الإثبات لدى الجهات المختصة والقضاء طالما أنها تحمل شعار وختم إنجاز.", "7)  يحق لـ إنجاز إنهاء الاشتراك في حال أرادت عدم الاستمرار بدون أي قيود أو في حالة استخدام المستفيد للنظام في غير الغرض المخصص له، أو إخلاله باحد أحكام وشروط استخدام الخدمة، أو في حال طلب الجهات المختصة إيقاف الخدمة عن المستفيد وفي هذه الحالة فقط يتم إعادة المبالغ المدفوعة للمستفيد عن المدة المتبقية من الاشتراك فقط دون المطالبة بای تعویض آخر، كما ينتهي الاشتراك في حالة الظروف القاهرة .", "8)  لا يحق للمستفيد مطالبة إنجاز بمراجعات الجهات الحكومية أو شبه الحكومية حيث أن الخدمة فقط لإدارة الخدمات الإلكترونية ويقوم المستفيد بتوفير موظفين يقوم بالمراجعات في حال الحاجة لذلك .",]
    const tenth = ["1)  تنطبق على خدمة الاشتراك في باقات إنجاز جميع الشروط والأحكام السابقة من البند الأول إلى البند الثامن .", "2)  يحق لمزود الخدمة تغيير ملحق تسعيرة خدمة الاشتراك في الباقات عند تجديد الاشتراك أو اضافة خدمات جديدة ويعتبر المستفيد أو مفوضه بعد استمراره في الاشتراك بعد اشعاره بالتغيير موافقة منه على القيمة الجديدة والالتزام بدفع المبالغ المالية والرسوم المترتبة على ذلك.", "3)  تنحصر إدارة خدمات وزارة الموارد البشرية في الخدمة الالكترونية المتوفرة في حساب المنشأة فقط وفق النظام المعمول به ولا يحق للمشترك مطالبة إنجاز بإجراء أي معاملة غير نظامية .", "4)  تنحصر إدارة خدمات وزارة التجارة في الخدمات الالكترونية ( تجديد السجلات التجارية – شطب السجلات التجارية – تعديل السجلات التجارية – حجز الأسماء التجارية) فقط.", "5) تنحصر إدارة خدمات التأمينات الإجتماعية في الخدمة الالكترونية المتوفرة في حساب المنشأة فقط وفق النظام المعمول به ولا يحق للمشترك مطالبة إنجاز بإجراء أي معاملة غير متوفرة في حساب المنشأة .", "6)  تنحصر إدارة خدمات الهيئة العامة للزكاة والدخل في الخدمات الالكترونية ( تقديم الاقرارات الزكوية – تقديم الاقرارات الضريبية – تسجيل المنشأة – إلغاء تسجيل المنشأة  ).", "7)  تنحصر إدارة خدمات وزارة الداخلية في الخدمة الالكترونية المتوفرة في حساب المنشأة فقط في أبشر أعمال أو خدمة مقيم ولا يحق للمشترك مطالبة إنجاز بإجراء أي معاملة غير متوفرة في حساب أبشر أعمال أو خدمة مقيم .", "8)  تنحصر إدارة خدمات بلدي في الخدمات الالكترونية ( إصدار رخصة بلدية – تجديد رخصة بلدية – إلغاء رخصة بلدية – تعديل رخصة بلدية ).", "9)  تنحصر إدارة خدمات سلامة ( الدفاع المدني ) في الخدمات الالكترونية (تقديم طلب إصدار رخصة الدفاع المدني – تجديد رخصة الدفاع المدن). ", "10)  تنحصر إدارة خدمات شركات التأمين في الخدمات الالكترونية ( إصدار وثيقة التأمين الطبي للعمالة – تجديد وثيقة التأمين الطبي  ).", "11)  تنحصر خدمة إشتراك إدارة الرواتب وحماية الأجور في الخدمات الالكترونية ( رفع ملفات الرواتب ، تدقيق الملفات ،تصحيح الأخطاء والمخالفات ).", "12)  تنحصر خدمة تخفيف الأعباء عن المنشآت في القيام بتسجيل منشأة المشترك في المبادرات الحكومية أو دراسة المنشأة بشكل عام ومساعدة متخذي القرار في تخفيف الأعباء المالية عبر إعداد تقرير بذلك إن أمكن .", "13)  تنحصر خدمة تصميم موقع في إنشاء موقع تعريفي مكون من مجموعة من الصفحات وفي حال رغبة العميل بتصميم موقع احترافي أو متجر الكتروني فيكون بعقد مستقل ولا يدخل ضمن هذا الاشتراك .", "14) تنحصر خدمة التسويق عبر مواقع التواصل الاجتماعي في إنشاء حساب للمنشأة في جميع مواقع التواصل الاجتماعي وربطها بالموقع الالكتروني للشركة وفي حال رغبة المشترك في التسويق عبر المواقع التي تتطلب دفع رسوم للاعلان فيكون المسئول عن تحمل هذه الرسوم هو المستفيد ولا يحق له مطالبة إنجاز بذلك.", "15) الميزات المجانية تشمل البحث والحجز بأقل الأسعار المتاحه لاكن لايشمل سعر التذكره او سعر الحجز او التأمين ."]

    const { lang, setlang, t, i18n } = useMyContext();

    return (
        <div >
            <CommonHead title={t('footer.ul10')} path={t('aboutus.path')} />
            <div className='Policies'>
                <div className="container">
                    <h1 className="section-title3">{t('footer.ul10')}</h1>
                    <div className="part">
                        <h2 className='mt-5'>أولا : التعريفات</h2>
                        <p>"إنجاز": مقدم الخدمة: <span>هي شركة إنجاز للخدمات التجارية</span></p>
                        <p>"باقات إنجاز" :<span>خدمة إدارة الموارد البشرية و الخدمات الإلكترونية للجهات الحكومية للمنشآت حيث تكون الخدمة فقط خاصة للخدمات الالكترونية وليس لمراجعة الجهات الحكومية </span></p>
                        <p>"المستفيد" :<span>هو المستفيد من خدمات باقات إنجاز</span></p>
                        <p>"الظروف الخارجه عن الإرادة" : <span>وهي الأسباب الخارجة عن السيطرة المعقولة </span></p>
                        <p>"باقة إنجاز البرونزية " :</p>
                        <span>تتيح هذه الخدمة إدارة الخدمات الإلكترونية للمنشأة وهي كالتالي :  </span>
                        <ul>
                            {part1.map((item, i) => {
                                return (
                                    <li key={i}>{item}</li>
                                )
                            })}
                        </ul>
                        <p>"باقة إنجاز الفضية" :</p>
                        <span>تتيح هذه الخدمة إدارة الخدمات الإلكترونية للمنشأة الوارد في باقة إنجاز البرونزية بالاضافة للخدمات التالية :</span>
                        <ul>
                            {part2.map((item, i) => {
                                return (
                                    <li key={i}>{item}</li>
                                )
                            })}
                        </ul>
                        <p>"باقة إنجاز الذهبية " :</p>
                        <span>تتيح هذه الخدمة مجموعة كبيرة من الخدمات الادارية وتشمل جميع الخدمات التي وردت في الباقة البرونزية والفضية بالإضافة للخدمات التالية
                            :
                        </span>
                        <ul>
                            {part3.map((item, i) => {
                                return (
                                    <li key={i}>{item}</li>
                                )
                            })}
                        </ul>
                        <p>"باقة إنجاز البلاتينية " :</p>
                        <span>تتيح هذه الخدمة إدارة الخدمات الإلكترونية للمنشأة وهي كالتالي :  </span>
                        <ul>
                            {part4.map((item, i) => {
                                return (
                                    <li key={i}>{item}</li>
                                )
                            })}
                        </ul>


                    </div>
                    <div className="part">
                        <h2>ثانيا : فئة الاشتراك</h2>
                        <p>يجب على المستفيد تحديد فئة الاشتراك التي يرغب بها وهي إما اشتراك الباقة البرونزية او الباقة الفضية أو الباقة الذهبية أو الباقة البلاتينية. </p>
                    </div>
                    <div className="part">
                        <h2>ثالثا : مدة الاشتراك</h2>
                        <p>الاشتراك ساري المفعول لمدة سنة ميلادية كاملة من تاريخ تحويل رسوم الباقة، و يتجدد تلقائيا مالم يتم إخطار المشترك إتمام برغبته في عدم التجديد قبل شهر من تاريخ نهاية الاشتراك وذلك من خلال وسائل التواصل المعتمدة .</p>
                    </div>
                    <div className="part">
                        <h2>رابعاً : وقت توفير الخدمة </h2>
                        <p>تبذل إنجاز قصارى جهدها لتوفير الخدمة على مدار الأربعة وعشرين ساعة و خلال العطل الرسمية مع عدم تحملها للمسؤولية في حال عدم توفر الخدمة لأي سبب من الأسباب.</p>
                    </div>
                    <div className="part">
                        <h2>خامساً : التزامات المشترك</h2>
                        {fifth.map((item, i) => {
                            return (<p key={i}>{item}</p>)
                        })}
                    </div>
                    <div className="part">
                        <h2>سادساً : بداية تفعيل الخدمة</h2>
                        <p>تبدأ الخدمة بعد سداد قيمة الاشتراك في الخدمة وفي حال رغبة المشترك تعديل الباقة أو إضافة خدمات جديدة يتم مراعاة ذلك بشرط توفر المستندات المطلوبة وسداد الفروقات للخدمات المضافة .</p>
                    </div>
                    <div className="part">
                        <h2>سابعاً : تكلفة الخدمة</h2>
                        <p>يدفع المستفيد قيمة الاشتراك الموضحة في نموذج الاشتراك ولا يتحمل المشترك أية مبالغ آخری خلال مدة الاشتراك ، ولا يدخل في قيمة هذا الاشتراك أي رسوم حكومية أو نحو ذلك وإنما المبلغ نظير تقديم الخدمة .</p>
                    </div>
                    <div className="part">
                        <h2>ثامناً : تسوية الخلافات</h2>
                        <p>يخضع هذا الاشتراك للأنظمة المعمول بها في المملكة ويجري تنفيذه وتفسيره بموجبها، و آی خلاف ينشأ عن تطبيق هذا الاشتراك او ما يتعلق به ولا يتم التوصل إلى تسويته، فإنه يتم حسمه وفقا لأنظمة المملكة العربية السعودية .</p>
                    </div>
                    <div className="part">
                        <h2>تاسعا : أحكام عامة</h2>
                        {ninth.map((item, i) => {
                            return (<p key={i}>{item}</p>)
                        })}
                    </div>
                    <div className="part">
                        <h2>عاشراً : الشروط والأحكام الخاصة بباقات إنجاز</h2>
                        {tenth.map((item, i) => {
                            return (<p key={i}>{item}</p>)
                        })}
                    </div>
                    <div className="part">
                        <h2>الموافقة والتفويض</h2>
                        <p>أقر أنا الموقع أدناه بأنني اطلعت على شروط وأحكام الاشتراك في باقات إنجاز وأوافق على جميع ماورد فيها   </p>
                    </div>
                    <div className="part">
                        <h2>حقوق الملكية الفكرية</h2>
                        <p>نملك كافة حقوق الملكية الفكرية لموقعنا، وجميع المواد المنشورة فيه تخضع لحماية قوانين حقوق الطبع والنشر والمعاهدات العالمية، وجميع هذه الحقوق محفوظة.</p>
                    </div>

                </div>
            </div>

        </div>
    )
}

export default Policies